===============
Boolean Literal
===============

_ = YES
_ = NO

---

(doxyfile
  (option
    (identifier)
    (literal
      (boolean)))
  (option
    (identifier)
    (literal
      (boolean))))

==============
Number Literal
==============

_ = 42

---

(doxyfile
  (option
    (identifier)
    (literal
      (number))))

=====================
Quoted String Literal
=====================

_ = "foo bar, qux, 42"

---

(doxyfile
  (option
    (identifier)
    (literal
      (quoted_string))))

==============================
Simple Unquoted String Literal
==============================

_ = Foo

---

(doxyfile
  (option
    (identifier)
    (literal
      (unquoted_string))))

===============================
Complex Unquoted String Literal
===============================

_ = FooBar-Qux_Quuz.Zir

---

(doxyfile
  (option
    (identifier)
    (literal
      (unquoted_string))))
